src/cf/Enums/ПолитикиУчетаРабочегоВремени.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>ПолитикиУчетаРабочегоВремени</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>НеУчитывать</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИспользоватьЕжедневныеОтчеты</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИспользоватьЕженедельныеОтчеты</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИспользоватьЕжедневныеИЕженедельныеОтчеты</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/Constants/ИспользоватьЕженедельныеОтчеты/Ext/ValueManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

Процедура ПриЗаписи(Отказ)
	
	Если ОбменДанными.Загрузка
		Или ПараметрыСеанса.ЗагрузкаОбработанныхДанныхИзДругойСистемы Тогда
		Возврат;
	КонецЕсли;
	
	Политика = Константы.ПолитикаУчетаРабочегоВремени.Получить();
	Если Значение Тогда
		Если Политика <> Перечисления.ПолитикиУчетаРабочегоВремени.ИспользоватьЕженедельныеОтчеты
			И Политика <> Перечисления.ПолитикиУчетаРабочегоВремени.ИспользоватьЕжедневныеИЕженедельныеОтчеты Тогда
			ВызватьИсключение 
				НСтр("ru = 'Политика учета рабочего времени не предусматривает ведение еженедельных отчетов.'");
		КонецЕсли;
	Иначе
		Если Политика = Перечисления.ПолитикиУчетаРабочегоВремени.ИспользоватьЕженедельныеОтчеты
			Или Политика = Перечисления.ПолитикиУчетаРабочегоВремени.ИспользоватьЕжедневныеИЕженедельныеОтчеты Тогда
			ВызватьИсключение 
				НСтр("ru = 'Политика учета рабочего времени предусматривает ведение еженедельных отчетов.'");
		КонецЕсли;
	КонецЕсли;
	
	Если Значение Тогда
		Константы.ИспользоватьДокументыУчетаРабочегоВремени.Установить(Истина);
	ИначеЕсли Не Константы.ИспользоватьЕжедневныеОтчеты.Получить() Тогда
		Константы.ИспользоватьДокументыУчетаРабочегоВремени.Установить(Ложь);
	КонецЕсли;
	
КонецПроцедуры

#Иначе
ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.'");
#КонецЕсли
